In [2]:
import numpy as np
import pandas as pd
import xlrd

In [3]:
data = pd.read_excel('Frequency of Purchase Analysis Data Question.xlsx',engine = 'openpyxl')

In [4]:
data

,Outlet ID,Brand Name,Sales Value,DATE,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,Outlet 1,Brand 1,395.6906,2018-04-10,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Outlet 1,Brand 1,395.6906,2018-04-24,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Outlet 1,Brand 2,724.9328,2018-04-10,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Outlet 1,Brand 3,150.0466,2018-04-10,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Outlet 1,Brand 3,300.0932,2018-04-24,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
25468,Outlet 23559,Brand 3,150.0466,2018-04-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25469,Outlet 23560,Brand 1,395.6906,2018-04-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25470,Outlet 23560,Brand 3,300.0932,2018-04-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25471,Outlet 23561,Brand 1,395.6906,2018-04-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25472,Outlet 23561,Brand 3,150.0466,2018-04-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
data.shape

(25473, 11)

In [8]:
data = data[['Outlet ID','Brand Name','Sales Value','DATE']]

In [9]:
data

          Outlet ID Brand Name  Sales Value       DATE
0          Outlet 1    Brand 1     395.6906 2018-04-10
1          Outlet 1    Brand 1     395.6906 2018-04-24
2          Outlet 1    Brand 2     724.9328 2018-04-10
3          Outlet 1    Brand 3     150.0466 2018-04-10
4          Outlet 1    Brand 3     300.0932 2018-04-24
...             ...        ...          ...        ...
25468  Outlet 23559    Brand 3     150.0466 2018-04-05
25469  Outlet 23560    Brand 1     395.6906 2018-04-05
25470  Outlet 23560    Brand 3     300.0932 2018-04-05
25471  Outlet 23561    Brand 1     395.6906 2018-04-05
25472  Outlet 23561    Brand 3     150.0466 2018-04-05

[25473 rows x 4 columns]

In [33]:
data.nunique(0)

Outlet ID      5811
Brand Name       11
Sales Value     334
DATE             25
dtype: int64

In [37]:
t_brands = 11
t_outlet = data.nunique()['Outlet ID']
t_outlet

5811

In [29]:
data["Brand Name"].value_counts()

Brand 9     5113
Brand 1     3665
Brand 2     3547
Brand 7     3301
Brand 10    2863
Brand 3     1951
Brand 6     1868
Brand 5     1496
Brand 8     1122
Brand 4      546
Brand 11       1
Name: Brand Name, dtype: int64

In [34]:
data["Outlet ID"].value_counts()

Outlet 928     9
Outlet 7174    9
Outlet 3289    9
Outlet 573     9
Outlet 5905    9
              ..
Outlet 2834    1
Outlet 898     1
Outlet 6673    1
Outlet 7034    1
Outlet 7591    1
Name: Outlet ID, Length: 5811, dtype: int64

total number of brands = 11  
the above data shows total number of times certain brands were bought

assuming i am the manager of all brands

In [76]:
# finding the outlets purchased for different number of times
outlet_count = data.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = data.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 1                             6    2139.5366
Outlet 10                            4    1786.7488
Outlet 100                           3    7468.2568
Outlet 1000                          9    9349.3012
Outlet 1001                          5    3872.9116
...                                ...          ...
Outlet 995                           6    3699.2062
Outlet 996                           9    6205.8504
Outlet 997                           6    7610.4926
Outlet 998                           6    3769.2204
Outlet 999                           9   13469.7246

[5811 rows x 2 columns]

In [80]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets   total sales
number of times purchased
1                                        818  8.108168e+05
2                                        717  9.274539e+05
3                                       1210  3.478157e+06
4                                        744  2.955618e+06
5                                        489  2.305511e+06
6                                        468  3.085521e+06
7                                        344  2.464057e+06
8                                        235  1.989405e+06
9                                        786  8.318669e+06

Considering for only brand1

In [22]:
brand1 = data[data['Brand Name']=='Brand 1']

In [23]:
brand1

          Outlet ID Brand Name  Sales Value       DATE
0          Outlet 1    Brand 1     395.6906 2018-04-10
1          Outlet 1    Brand 1     395.6906 2018-04-24
6          Outlet 2    Brand 1     791.3812 2018-04-17
11         Outlet 3    Brand 1     395.6906 2018-04-17
16         Outlet 4    Brand 1     395.6906 2018-04-10
...             ...        ...          ...        ...
25458  Outlet 23555    Brand 1     233.8146 2018-04-12
25462  Outlet 23557    Brand 1     467.6292 2018-04-19
25467  Outlet 23559    Brand 1     791.3812 2018-04-05
25469  Outlet 23560    Brand 1     395.6906 2018-04-05
25471  Outlet 23561    Brand 1     395.6906 2018-04-05

[3665 rows x 4 columns]

In [24]:
len(brand1)

3665

In [81]:
# finding the outlets purchased for different number of times
outlet_count = brand1.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand1.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 1                             2     791.3812
Outlet 10                            3    1636.7022
Outlet 1002                          2    1007.1970
Outlet 1003                          2    1007.1970
Outlet 1004                          1    1223.0128
...                                ...          ...
Outlet 993                           1    1187.0718
Outlet 994                           1    1223.0128
Outlet 995                           2    1007.1970
Outlet 996                           1     395.6906
Outlet 998                           2    1007.1970

[2133 rows x 2 columns]

In [82]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets  total sales
number of times purchased
1                                       1121  720219.7180
2                                        644  803817.6916
3                                        259  479013.3278
4                                         78  193059.0908
5                                         19   51672.9700
6                                         12   44111.2100

In [40]:
# frequncy of purchase of brand1
fp = len(brand1)/t_outlet
fp

0.630700395801067

In [43]:
#total number of sales value
brand1['Sales Value'].sum()

2291894.0082

considering for brand2 alone

In [44]:
brand2 = data[data['Brand Name']=='Brand 2']
brand2

          Outlet ID Brand Name  Sales Value       DATE
2          Outlet 1    Brand 2     724.9328 2018-04-10
7          Outlet 2    Brand 2     362.4664 2018-04-17
8          Outlet 2    Brand 2     538.2660 2018-04-17
9          Outlet 2    Brand 2     585.8100 2018-04-17
12         Outlet 3    Brand 2     276.0948 2018-04-24
...             ...        ...          ...        ...
25449  Outlet 23552    Brand 2     878.7150 2018-04-12
25456  Outlet 23554    Brand 2     292.9050 2018-04-12
25460  Outlet 23556    Brand 2     585.8100 2018-04-12
25463  Outlet 23557    Brand 2    1464.5250 2018-04-19
25465  Outlet 23558    Brand 2     292.9050 2018-04-05

[3547 rows x 4 columns]

In [83]:
# finding the outlets purchased for different number of times
outlet_count = brand2.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand2.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 1                             1     724.9328
Outlet 1037                          1     585.8100
Outlet 1039                          2     944.6540
Outlet 104                           1     362.4664
Outlet 1040                          2     784.4194
...                                ...          ...
Outlet 890                           1     585.8100
Outlet 9                             2     661.0314
Outlet 926                           1     292.9050
Outlet 930                           1     292.9050
Outlet 931                           1     292.9050

[2329 rows x 2 columns]

In [84]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets   total sales
number of times purchased
1                                       1436  1.039915e+06
2                                        637  8.438762e+05
3                                        197  3.874004e+05
4                                         49  1.326351e+05
5                                         10  4.002214e+04

In [47]:
# frequncy of purchase of brand2
fp = len(brand2)/t_outlet
fp

0.6103940801927379

In [49]:
#total number of sales value
brand2['Sales Value'].sum()

2443848.4244

Brand 3

In [85]:
brand3 = data[data['Brand Name']=='Brand 3']
brand3

          Outlet ID Brand Name  Sales Value       DATE
3          Outlet 1    Brand 3     150.0466 2018-04-10
4          Outlet 1    Brand 3     300.0932 2018-04-24
13         Outlet 3    Brand 3     150.0466 2018-04-24
14         Outlet 3    Brand 3     450.1398 2018-04-17
22         Outlet 5    Brand 3     150.0466 2018-04-10
...             ...        ...          ...        ...
25464  Outlet 23557    Brand 3     150.0466 2018-04-19
25466  Outlet 23558    Brand 3     300.0932 2018-04-05
25468  Outlet 23559    Brand 3     150.0466 2018-04-05
25470  Outlet 23560    Brand 3     300.0932 2018-04-05
25472  Outlet 23561    Brand 3     150.0466 2018-04-05

[1951 rows x 4 columns]

In [86]:
# finding the outlets purchased for different number of times
outlet_count = brand3.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand3.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 1                             2     450.1398
Outlet 10                            1     150.0466
Outlet 100                           1     600.1864
Outlet 1000                          2     600.1864
Outlet 1007                          1     300.0932
...                                ...          ...
Outlet 982                           1     450.1398
Outlet 99                            1     300.0932
Outlet 992                           2     900.2796
Outlet 996                           1     150.0466
Outlet 999                           1     750.2330

[1762 rows x 2 columns]

In [87]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets  total sales
number of times purchased
1                                       1588  612790.3144
2                                        159  127689.6566
3                                         15   12153.7746

In [88]:
# frequncy of purchase of brand2
fp = len(brand3)/t_outlet
fp

0.33574255721906726

In [89]:
#total number of sales value
brand3['Sales Value'].sum()

752633.7456000001

Brand 4

In [91]:
brand4 = data[data['Brand Name']=='Brand 4']
brand4

          Outlet ID Brand Name  Sales Value       DATE
5          Outlet 1    Brand 4     173.0828 2018-04-24
15         Outlet 3    Brand 4     220.9098 2018-04-24
18         Outlet 4    Brand 4     220.9098 2018-04-10
24         Outlet 5    Brand 4     220.9098 2018-04-10
30         Outlet 7    Brand 4     220.9098 2018-04-10
...             ...        ...          ...        ...
24716  Outlet 23376    Brand 4    2700.3860 2018-04-26
24733  Outlet 23379    Brand 4     441.8196 2018-04-28
24738  Outlet 23380    Brand 4     441.8196 2018-04-11
25439  Outlet 23548    Brand 4     270.0386 2018-04-20
25440  Outlet 23548    Brand 4     346.1656 2018-04-20

[546 rows x 4 columns]

In [92]:
# finding the outlets purchased for different number of times
outlet_count = brand4.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand4.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 1                             1     173.0828
Outlet 103                           1     220.9098
Outlet 1037                          1     270.0386
Outlet 104                           1     220.9098
Outlet 106                           1     220.9098
...                                ...          ...
Outlet 91                            1     220.9098
Outlet 92                            1     220.9098
Outlet 93                            1     220.9098
Outlet 95                            1     220.9098
Outlet 96                            1     220.9098

[406 rows x 2 columns]

In [93]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets  total sales
number of times purchased
1                                        303  146858.4352
2                                         73   50729.2782
3                                         24   21639.5950
4                                          5    5074.0768
5                                          1    1745.9402

In [94]:
# frequncy of purchase of brand2
fp = len(brand4)/t_outlet
fp

0.09395973154362416

In [96]:
#total number of sales value
brand4['Sales Value'].sum()

226047.3254

Brand 5

In [102]:
brand5 = data[data['Brand Name']=='Brand 5']
brand5

          Outlet ID Brand Name  Sales Value       DATE
10         Outlet 3    Brand 5     350.2408 2018-04-17
19         Outlet 5    Brand 5     350.2408 2018-04-24
47        Outlet 11    Brand 5     350.2408 2018-04-17
62        Outlet 15    Brand 5     350.2408 2018-04-03
68        Outlet 17    Brand 5     350.2408 2018-04-03
...             ...        ...          ...        ...
25324  Outlet 23513    Brand 5     764.1000 2018-04-21
25333  Outlet 23514    Brand 5     764.1000 2018-04-07
25334  Outlet 23514    Brand 5     764.1000 2018-04-21
25347  Outlet 23516    Brand 5     764.1000 2018-04-25
25448  Outlet 23551    Brand 5    2292.3000 2018-04-19

[1496 rows x 4 columns]

In [103]:
# finding the outlets purchased for different number of times
outlet_count = brand5.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand5.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 1002                          1    1528.2000
Outlet 1003                          1     700.4816
Outlet 1004                          1     764.1000
Outlet 1023                          1     764.1000
Outlet 1025                          1     764.1000
...                                ...          ...
Outlet 971                           1    1528.2000
Outlet 973                           1    1528.2000
Outlet 991                           1    1528.2000
Outlet 993                           1     764.1000
Outlet 994                           1     764.1000

[1300 rows x 2 columns]

In [104]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets   total sales
number of times purchased
1                                       1112  2.105609e+06
2                                        180  6.353515e+05
3                                          8  2.518383e+04

In [106]:
# frequncy of purchase of brand2
fp = len(brand5)/t_outlet
fp

0.25744278093271383

In [108]:
#total number of sales value
brand5['Sales Value'].sum()

2766143.88

Brand 6

In [114]:
brand6 = data[data['Brand Name']=='Brand 6']
brand6

          Outlet ID Brand Name  Sales Value       DATE
83        Outlet 20    Brand 6     276.6608 2018-04-17
128       Outlet 30    Brand 6     366.2020 2018-04-17
134       Outlet 32    Brand 6    1383.3040 2018-04-17
141       Outlet 34    Brand 6     679.2000 2018-04-17
142       Outlet 34    Brand 6    1106.6432 2018-04-17
...             ...        ...          ...        ...
25220  Outlet 23487    Brand 6     553.3216 2018-04-18
25258  Outlet 23496    Brand 6     366.2020 2018-04-18
25266  Outlet 23497    Brand 6    1098.6060 2018-04-17
25315  Outlet 23512    Brand 6     549.3030 2018-04-07
25446  Outlet 23551    Brand 6     829.9824 2018-04-19

[1868 rows x 4 columns]

In [115]:
# finding the outlets purchased for different number of times
outlet_count = brand6.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand6.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 1002                          2    1379.2854
Outlet 1003                          2    1379.2854
Outlet 1004                          1     829.9824
Outlet 1023                          2    1655.9462
Outlet 1027                          2    1562.3864
...                                ...          ...
Outlet 991                           2    1379.2854
Outlet 993                           1     732.4040
Outlet 994                           1     829.9824
Outlet 995                           2    1285.7256
Outlet 998                           2    1379.2854

[1369 rows x 2 columns]

In [116]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets  total sales
number of times purchased
1                                        912  582795.8802
2                                        421  480188.1174
3                                         30   44579.4052
4                                          6   10818.0712

In [118]:
# frequncy of purchase of brand2
fp = len(brand6)/t_outlet
fp

0.3214593013250731

In [119]:
#total number of sales value
brand6['Sales Value'].sum()

1118381.474

Brand 7

In [129]:
brand7 = data[data['Brand Name']=='Brand 7']
brand7

          Outlet ID Brand Name  Sales Value       DATE
74        Outlet 19    Brand 7     814.7004 2018-04-03
84        Outlet 20    Brand 7     438.6500 2018-04-17
85        Outlet 20    Brand 7     814.7004 2018-04-17
87        Outlet 21    Brand 7     362.0136 2018-04-24
94        Outlet 23    Brand 7     227.4188 2018-04-03
...             ...        ...          ...        ...
25353  Outlet 23519    Brand 7     227.4188 2018-04-09
25386  Outlet 23532    Brand 7     988.0662 2018-04-28
25432  Outlet 23547    Brand 7     219.3250 2018-04-13
25433  Outlet 23547    Brand 7     329.3554 2018-04-13
25447  Outlet 23551    Brand 7     724.0272 2018-04-19

[3301 rows x 4 columns]

In [130]:
# finding the outlets purchased for different number of times
outlet_count = brand7.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand7.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 1000                          1    1086.0408
Outlet 1001                          2    1332.1376
Outlet 1002                          1     909.6752
Outlet 1003                          2    1633.7024
Outlet 1004                          1     909.6752
...                                ...          ...
Outlet 995                           2    1406.2836
Outlet 996                           3    1271.6888
Outlet 997                           3    2528.9446
Outlet 998                           2    1382.7380
Outlet 999                           2    2325.3544

[1981 rows x 2 columns]

In [131]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets  total sales
number of times purchased
1                                       1078  857363.7820
2                                        615  957120.1500
3                                        187  438362.3588
4                                         82  239555.4814
5                                         11   42544.3522
6                                          7   38073.6880
7                                          1    4225.8692

In [132]:
# frequncy of purchase of brand2
fp = len(brand7)/t_outlet
fp

0.5680605747719841

In [133]:
#total number of sales value
brand7['Sales Value'].sum()

2577245.6816

Brand 8

In [134]:
brand8 = data[data['Brand Name']=='Brand 8']
brand8

          Outlet ID Brand Name  Sales Value       DATE
78        Outlet 19    Brand 8     2689.632 2018-04-03
79        Outlet 19    Brand 8     2689.632 2018-04-17
96        Outlet 23    Brand 8      448.272 2018-04-03
108       Outlet 25    Brand 8      448.272 2018-04-03
126       Outlet 29    Brand 8     2689.632 2018-04-17
...             ...        ...          ...        ...
25223  Outlet 23487    Brand 8     1344.816 2018-04-18
25270  Outlet 23497    Brand 8     2689.632 2018-04-17
25319  Outlet 23512    Brand 8     5379.264 2018-04-07
25325  Outlet 23513    Brand 8     5379.264 2018-04-21
25335  Outlet 23514    Brand 8     2689.632 2018-04-21

[1122 rows x 4 columns]

In [135]:
# finding the outlets purchased for different number of times
outlet_count = brand8.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand8.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 1002                          1     2689.632
Outlet 1003                          1     2689.632
Outlet 1023                          1     2689.632
Outlet 1025                          1     2689.632
Outlet 1026                          1      896.544
...                                ...          ...
Outlet 94                            1     1793.088
Outlet 962                           1     5379.264
Outlet 98                            1     2689.632
Outlet 991                           1     2241.360
Outlet 996                           1     1344.816

[1012 rows x 2 columns]

In [136]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets   total sales
number of times purchased
1                                        907  2.170102e+06
2                                        100  4.450496e+05
3                                          5  4.213757e+04

In [137]:
# frequncy of purchase of brand2
fp = len(brand8)/t_outlet
fp

0.19308208569953536

In [138]:
#total number of sales value
brand8['Sales Value'].sum()

2657289.6846000003

Brand 9

In [139]:
brand9 = data[data['Brand Name']=='Brand 9']
brand9

          Outlet ID Brand Name  Sales Value       DATE
88        Outlet 21    Brand 9     179.3088 2018-04-24
89        Outlet 21    Brand 9     631.9956 2018-04-24
92        Outlet 22    Brand 9     179.3088 2018-04-10
93        Outlet 22    Brand 9     462.0824 2018-04-10
99        Outlet 23    Brand 9     924.1648 2018-04-24
...             ...        ...          ...        ...
25346  Outlet 23515    Brand 9    2949.3128 2018-04-25
25358  Outlet 23520    Brand 9    2106.6520 2018-04-30
25388  Outlet 23532    Brand 9    3581.3084 2018-04-28
25392  Outlet 23533    Brand 9    1263.9912 2018-04-11
25435  Outlet 23547    Brand 9    1895.9868 2018-04-13

[5113 rows x 4 columns]

In [140]:
# finding the outlets purchased for different number of times
outlet_count = brand9.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand9.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 100                           1    2527.9824
Outlet 1000                          4    3322.9860
Outlet 1001                          2    1094.0780
Outlet 101                           1    2527.9824
Outlet 102                           2     811.3044
...                                ...          ...
Outlet 992                           4    5069.4356
Outlet 994                           1    1053.3260
Outlet 996                           2    1596.9124
Outlet 997                           2    2188.1560
Outlet 999                           4    4607.3532

[3049 rows x 2 columns]

In [141]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets   total sales
number of times purchased
1                                       1666  2.573965e+06
2                                        948  2.804138e+06
3                                        270  1.100688e+06
4                                        116  5.001336e+05
5                                         28  1.678628e+05
6                                         15  9.802645e+04
7                                          2  1.763226e+04
8                                          3  2.589982e+04
9                                          1  6.843393e+03

In [142]:
# frequncy of purchase of brand2
fp = len(brand9)/t_outlet
fp

0.8798829805541215

In [143]:
#total number of sales value
brand9['Sales Value'].sum()

7295188.8292

Brand 10

In [144]:
brand10 = data[data['Brand Name']=='Brand 10']
brand10

          Outlet ID Brand Name  Sales Value       DATE
98        Outlet 23   Brand 10    4340.0880 2018-04-24
103       Outlet 24   Brand 10    1446.6960 2018-04-10
114       Outlet 26   Brand 10    1446.6960 2018-04-10
123       Outlet 28   Brand 10    1446.6960 2018-04-24
147       Outlet 35   Brand 10     289.3392 2018-04-10
...             ...        ...          ...        ...
25357  Outlet 23520   Brand 10    1446.6960 2018-04-30
25387  Outlet 23532   Brand 10    2893.3920 2018-04-28
25391  Outlet 23533   Brand 10    1446.6960 2018-04-11
25434  Outlet 23547   Brand 10    1446.6960 2018-04-13
25445  Outlet 23550   Brand 10     482.2320 2018-04-17

[2863 rows x 4 columns]

In [145]:
# finding the outlets purchased for different number of times
outlet_count = brand10.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand10.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 100                           1     4340.088
Outlet 1000                          2     4340.088
Outlet 1001                          1     1446.696
Outlet 101                           1     4340.088
Outlet 1025                          1     2893.392
...                                ...          ...
Outlet 992                           2     5786.784
Outlet 994                           1     1446.696
Outlet 996                           1     1446.696
Outlet 997                           1     2893.392
Outlet 999                           2     5786.784

[2257 rows x 2 columns]

In [146]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets   total sales
number of times purchased
1                                       1714  2.578398e+06
2                                        486  1.377351e+06
3                                         51  2.077455e+05
4                                          6  3.684252e+04

In [147]:
# frequncy of purchase of brand2
fp = len(brand10)/t_outlet
fp

0.49268628463259334

In [148]:
#total number of sales value
brand10['Sales Value'].sum()

4200337.1663999995

Brand 11

In [151]:
brand11 = data[data['Brand Name']=='Brand 11']
brand11

         Outlet ID Brand Name  Sales Value       DATE
11234  Outlet 2578   Brand 11       6197.7 2018-04-27

In [152]:
# finding the outlets purchased for different number of times
outlet_count = brand11.groupby(['Outlet ID']).count()
outlet_count.drop(columns=['Sales Value','DATE'],inplace=True)
outlet_count.columns = ['number of times purchased']
outlet_count['total sales'] = brand11.groupby(['Outlet ID']).sum()
outlet_count

             number of times purchased  total sales
Outlet ID
Outlet 2578                          1       6197.7

In [153]:
f_count = outlet_count.groupby(['number of times purchased']).count()
f_count.columns = ['number of outlets']
f_count['total sales'] = outlet_count.groupby(['number of times purchased']).sum()
f_count

                           number of outlets  total sales
number of times purchased
1                                          1       6197.7

In [154]:
# frequncy of purchase of brand2
fp = len(brand11)/t_outlet
fp

0.00017208742040956807

In [155]:
#total number of sales value
brand11['Sales Value'].sum()

6197.7